RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/drivers/fsl_smartcard_uart.c
/*
 * Copyright (c) 2015-2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2017 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_smartcard_uart.h"

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.smartcard_uart"
#endif

/*******************************************************************************
 * Variables
 ******************************************************************************/
/* Array of UART peripheral base address. */
static UART_Type *const s_uartBases[] = UART_BASE_PTRS;
#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
/* Array of UART clock name. */
static const clock_ip_name_t s_uartClock[] = UART_CLOCKS;
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
static void smartcard_uart_CompleteSendData(UART_Type *base, smartcard_context_t *context);
static void smartcard_uart_StartSendData(UART_Type *base, smartcard_context_t *context);
static void smartcard_uart_CompleteReceiveData(UART_Type *base, smartcard_context_t *context);
static void smartcard_uart_StartReceiveData(UART_Type *base, smartcard_context_t *context);
static void smartcard_uart_SetTransferType(UART_Type *base, smartcard_context_t *context, smartcard_control_t control);
static void smartcard_uart_TimerInit(uint8_t channel);
static void smartcard_uart_TimerStop(uint8_t channel);
static uint32_t smartcard_uart_GetInstance(UART_Type *base);
static status_t smartcard_uart_ConfigureBaudrate(UART_Type *base, smartcard_context_t *context);
/*******************************************************************************
 * Code
 ******************************************************************************/

/*!
 * @brief Get the UART instance from peripheral base address.
 *
 * @param base UART peripheral base address.
 * @return UART instance.
 */
static uint32_t smartcard_uart_GetInstance(UART_Type *base)
{
    uint32_t instance;
    uint32_t uartArrayCount = (sizeof(s_uartBases) / sizeof(s_uartBases[0]));
    /* Find the instance index from base address mappings. */
    for (instance = 0; instance < uartArrayCount; instance++)
    {
        if (MSDK_REG_SECURE_ADDR(s_uartBases[instance]) == MSDK_REG_SECURE_ADDR(base))
        {
            break;
        }
    }

    assert(instance < uartArrayCount);

    return instance;
}

/*!
 * @brief Finish up a transmit by completing the process of sending data and disabling the interrupt.
 *
 * @param base The UART peripheral base address.
 * @param context A pointer to a SMARTCARD driver context structure.
 */
static void smartcard_uart_CompleteSendData(UART_Type *base, smartcard_context_t *context)
{
    assert((NULL != context));

    /* Disable TCIE and TI interrupt */
    base->C2 &= ~(UART_C2_TCIE_MASK | UART_C2_TIE_MASK);

    /* Switch to receive mode after transmission is complete */
    base->C3 &= ~UART_C3_TXDIR_MASK;
    /* disable transmitter after transmit */
    base->C2 &= ~UART_C2_TE_MASK;
    /* Update the information of the module driver context */
    context->xIsBusy       = false;
    context->transferState = kSMARTCARD_IdleState;
    /* Clear txSize to avoid any spurious transmit from ISR */
    context->xSize = 0u;
    /* Invoke user call-back */
    if (NULL != context->transferCallback)
    {
        context->transferCallback(context, context->transferCallbackParam);
    }
}

/*!
 * @brief Finish up a receive by completing the process of receiving data and disabling the interrupt.
 *
 * @param base The UART peripheral base address.
 * @param context A pointer to a SMARTCARD driver context structure.
 */
static void smartcard_uart_CompleteReceiveData(UART_Type *base, smartcard_context_t *context)
{
    assert(NULL != context);

    /* Disable receive data full interrupt */
    base->C2 &= ~UART_C2_RIE_MASK;

    /* Read data from fifo */
    while ((base->RCFIFO) && (context->xSize))
    {
        /* Get data and put into receive buffer */
        *context->xBuff = (uint8_t)(base->D);
        ++context->xBuff;
        --context->xSize;
    }

    if (context->tType == kSMARTCARD_T1Transport)
    {
        base->C2 &= ~UART_C2_RE_MASK;
    }
    /* Update the information of the module driver context */
    context->xIsBusy       = false;
    context->transferState = kSMARTCARD_IdleState;
    /* Invoke user call-back */
    if (NULL != context->transferCallback)
    {
        context->transferCallback(context, context->transferCallbackParam);
    }
}

/*!
 * @brief Initiate (start) a transmit by beginning the process of sending data and enabling the interrupt.
 *
 * @param base The UART peripheral base address.
 * @param context A pointer to a SMARTCARD driver context structure.
 */
static void smartcard_uart_StartSendData(UART_Type *base, smartcard_context_t *context)
{
    assert(NULL != context);

    context->transferState = kSMARTCARD_TransmittingState;
    /* Disable transmitter */
    base->C2 &= ~(UART_C2_TE_MASK);
    /* Check if current transport protocol is T=1 */
    if (context->tType == kSMARTCARD_T1Transport)
    { /* Reset CWT timer at the beginning of transmission only */
        context->timersState.cwtExpired = false;
        /* clear any pending Character WT interrupt flag */
        base->IS7816 |= UART_IS7816_CWT_MASK;
        /* The TLEN does not count the NAD, PCB, LEN, LRC */
        base->TL7816 = context->xSize - 4u;
    }
    context->xIsBusy = true;
    /* Set the TX pin as output */
    base->C3 |= UART_C3_TXDIR_MASK;
    /* Flush tx fifo */
    base->CFIFO |= 0x80;
    /* Enable transmitter */
    base->C2 |= (UART_C2_TE_MASK);

    /* Enable TIE interrupt */
    base->C2 |= UART_C2_TIE_MASK;
}

/*!
 * @brief Initiate (start) a receive by beginning the process of receiving data and enabling the interrupt.
 *
 * @param base The UART peripheral base address.
 * @param context A pointer to a SMARTCARD driver context structure.
 */
static void smartcard_uart_StartReceiveData(UART_Type *base, smartcard_context_t *context)
{
    assert((NULL != context));

    /* Initialize the module driver context structure to indicate transfer in progress */
    context->xIsBusy = true;
    /* Disable transmitter */
    base->C2 &= ~UART_C2_TE_MASK;

    /* Set the rx threshold - RWFIFO[RXWATER] */
    if ((context->tType == kSMARTCARD_T1Transport) && (base->IE7816 & UART_IE7816_BWTE_MASK))
    {
        /* After receiving one byte is necessary to disable BWT interrupt and enable CWT interrupt */
        base->RWFIFO = 1;
    }
    else
    {
        if (context->xSize < context->rxFifoThreshold)
        {
            base->RWFIFO = context->xSize;
        }
        else
        {
            base->RWFIFO = context->rxFifoThreshold;
        }
    }
    /* Flush rx fifo */
    base->CFIFO |= 0x40;

    /* Enable receiver and switch to receive direction */
    base->C2 |= UART_C2_RE_MASK;
    base->C3 &= ~UART_C3_TXDIR_MASK;
    /* Disable GTV flag for data receiving */
    base->IE7816 &= ~UART_IE7816_GTVE_MASK;
    /* Enable RIE interrupt */
    base->C2 |= UART_C2_RIE_MASK;
}

/*!
 * @brief Sets up the UART hardware for T=0 or T=1 protocol data exchange and initialize timer values.
 *
 * @param base The UART peripheral base address.
 * @param context A pointer to a SMARTCARD driver context structure.
 */
static void smartcard_uart_SetTransferType(UART_Type *base, smartcard_context_t *context, smartcard_control_t control)
{
    assert((NULL != context));
    assert((control == kSMARTCARD_SetupATRMode) || (control == kSMARTCARD_SetupT0Mode) ||
           (control == kSMARTCARD_SetupT1Mode));

