RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/drivers/fsl_smartcard_uart.c
#if defined(FSL_FEATURE_UART_HAS_IMPROVED_SMART_CARD_SUPPORT) && (FSL_FEATURE_UART_HAS_IMPROVED_SMART_CARD_SUPPORT)
    uint16_t temp16;
    uint16_t bwiVal = 0u;
#endif
    uint8_t temp8;

    if (control == kSMARTCARD_SetupATRMode)
    { /* Set default values as per EMV specification */
        context->cardParams.Fi       = 372u;
        context->cardParams.currentD = 1u;
        context->cardParams.WI       = 0x0Au;
        /* Configure UART baud rate */
        smartcard_uart_ConfigureBaudrate(base, context);
        base->C2 &= ~UART_C2_RE_MASK;
        base->IS7816 = 0xFF;
        base->CFIFO |= 0xC0;
        (void)base->C3;
        (void)base->D;

        /* Disable ISO7816 mode 1st and Set transport protocol type to T=0 */
        base->C7816 = 0u;
/* Calculate and set Work Wait Timer (WWT) */
#if defined(FSL_FEATURE_UART_HAS_IMPROVED_SMART_CARD_SUPPORT) && (FSL_FEATURE_UART_HAS_IMPROVED_SMART_CARD_SUPPORT)
        /* EMV expectation: WWT = (960 x D x WI) + (D x 480) = 480xD x (2xWI + 1)
         * UART formula: WI x 480 */
        temp16                 = context->cardParams.currentD * ((2u * context->cardParams.WI) + 1u);
        base->TYPE0.WP7816A_T0 = (uint8_t)(temp16 >> 8u);
        base->TYPE0.WP7816B_T0 = (uint8_t)(temp16);
#else
        base->WP7816T0 = context->cardParams.WI;
#endif
        /* Set Extended Guard Timer value
         * EMV expectation: GT = GTN not equal to 255 -> 12 + GTN = GTN equal to 255 -> 12
         * UART formula: same as above */
        if ((context->cardParams.GTN <= SMARTCARD_EMV_RX_TO_TX_GUARD_TIME_T0))
        {
            temp8 = SMARTCARD_EMV_RX_TO_TX_GUARD_TIME_T0;
        }
        else
        { /* All other values include default 0xFF */
            temp8 = context->cardParams.GTN;
        }
        temp8++;
        base->WN7816 = temp8;
        /* Set FD multiplier */
        base->WF7816 = context->cardParams.currentD;
        /* Setup for single wire ISO7816 mode */
        base->C1 |= (UART_C1_LOOPS_MASK | UART_C1_RSRC_MASK | UART_C1_M_MASK);
        /* Normally, parity mode should be set to kUartParityEven,
         * but in case can be set to kUartParityOdd to help in initial character
         * (TS) detection by SW(by switching off hardware feature) */
        if (context->parity == kSMARTCARD_OddParity)
        {
            base->C1 |= (UART_C1_PT_MASK | UART_C1_PE_MASK);
        }
        else
        {
            base->C1 = (base->C1 & ~UART_C1_PT_MASK) | UART_C1_PE_MASK;
        }
        /* Setting RX threshold to 0 so that an interrupt is generated when a NACK is
         * sent either due to parity error or wrong INIT char.
         * Setting up TX NACK threshold */
        base->ET7816 = (SMARTCARD_EMV_TX_NACK_THRESHOLD << UART_ET7816_TXTHRESHOLD_SHIFT);
        /* Enable Interrupt for RXT crossing */
        base->IE7816 |= UART_IE7816_RXTE_MASK;
        /* Enable parity error indication */
        base->C3 |= UART_C3_PEIE_MASK;
        /* Disable ANACK generation and Enable ISO7816 mode */
        base->C7816 = (base->C7816 & ~UART_C7816_ANACK_MASK) | UART_C7816_ISO_7816E_MASK;
        /* Set transport type to T=0 in SMARTCARD context structure */
        context->tType = kSMARTCARD_T0Transport;
    }
    else if (control == kSMARTCARD_SetupT0Mode)
    {
        base->IS7816 = 0xFF;
        base->C2 &= ~UART_C2_RE_MASK;
        /* Disable ISO7816 mode 1st and Set transport protocol type to T=0 */
        base->C7816 &= ~(UART_C7816_ISO_7816E_MASK | UART_C7816_TTYPE_MASK);
/* Calculate and set Work Wait Timer (WWT) */
#if defined(FSL_FEATURE_UART_HAS_IMPROVED_SMART_CARD_SUPPORT) && (FSL_FEATURE_UART_HAS_IMPROVED_SMART_CARD_SUPPORT)
        /* EMV expectation: WWT = (960 x D x WI) + (D x 480) = 480xD x (2xWI + 1)
         * UART formula: WI x 480 */
        temp16                 = context->cardParams.currentD * ((2u * context->cardParams.WI) + 1u);
        base->TYPE0.WP7816A_T0 = (uint8_t)(temp16 >> 8u);
        base->TYPE0.WP7816B_T0 = (uint8_t)(temp16);
#else
        base->WP7816T0 = (uint8_t)context->cardParams.WI;
#endif
        /* Set Extended Guard Timer value
         * EMV expectation: GT = GTN not equal to 255 -> 12 + GTN = GTN equal to 255 -> 12
         * UART formula: same as above */
        if (context->cardParams.GTN < 0xFB)
        {
            temp8 = context->cardParams.GTN + 4u;
        }
        else
        {
            temp8 = context->cardParams.GTN;
        }
        if (temp8 == 255)
        {
            temp8--;
        }
        base->WN7816 = temp8;
        /* Set FD multiplier */
        base->WF7816 = (uint8_t)context->cardParams.currentD;
        /* Setup for single wire ISO7816 mode, 9 bits per char */
        base->C1 |= UART_C1_LOOPS_MASK | UART_C1_RSRC_MASK | UART_C1_M_MASK;
        /* Normally, parity mode should be set to kUartParityEven,
         * but in case can be set to kUartParityOdd to help in initial character
         * (TS) detection by SW(by switching off hardware feature) */
        if (context->parity == kSMARTCARD_OddParity)
        {
            base->C1 |= UART_C1_PT_MASK | UART_C1_PE_MASK;
        }
        else
        {
            base->C1 = (base->C1 & ~UART_C1_PT_MASK) | UART_C1_PE_MASK;
        }
        /* Setting RX threshold so that an interrupt is generated when a NACK is
         * sent either due to parity error or wrong INIT char
         * Setting up TX NACK threshold */
        base->ET7816 = ((SMARTCARD_EMV_RX_NACK_THRESHOLD << UART_ET7816_RXTHRESHOLD_SHIFT) |
                        (SMARTCARD_EMV_TX_NACK_THRESHOLD << UART_ET7816_TXTHRESHOLD_SHIFT));
        /* Enable Interrupt for RXT crossing */
        base->IE7816 |= UART_IE7816_RXTE_MASK;
        base->IE7816 |= UART_IE7816_TXTE_MASK;
        /* Disable parity error interrupt */
        base->C3 &= ~UART_C3_PEIE_MASK;
        /* Enable ISO7816 mode and Enable NACK on error interrupt */
        base->C7816 |= (UART_C7816_ISO_7816E_MASK | UART_C7816_ANACK_MASK);
        /* re-enable Receiver */
        base->C2 |= UART_C2_RE_MASK;
        /* Set transport type to T=0 in SMARTCARD context structure */
        context->tType = kSMARTCARD_T0Transport;
    }
    else
    { /* Disable ISO7816 mode 1st */
        base->C7816 = 0u;
/* Calculate and set Block Wait Timer (BWT) value */
#if defined(FSL_FEATURE_UART_HAS_IMPROVED_SMART_CARD_SUPPORT) && (FSL_FEATURE_UART_HAS_IMPROVED_SMART_CARD_SUPPORT)
        /* EMV expectation: BWT = 11 + (2^BWI x 960 x D) + (D x 960) = 11 + (2^BWI + 1) x 960 x D
         * UART formula: BWT = (11 + (BWI x 960 x GTFD)) * (WTX + 1) */
        bwiVal                 = (1 << context->cardParams.BWI) + 1u;
        base->TYPE1.WP7816A_T1 = (uint8_t)(bwiVal >> 8u);
        base->TYPE1.WP7816B_T1 = (uint8_t)(bwiVal);
#else
        base->WP7816T1 = context->cardParams.BWI;
#endif
#if defined(FSL_FEATURE_UART_HAS_IMPROVED_SMART_CARD_SUPPORT) && (FSL_FEATURE_UART_HAS_IMPROVED_SMART_CARD_SUPPORT)
        /* Set Wait Timer Multiplier default value */
        base->WP7816 = 0u;
#endif
/* Calculate and set Character Wait Timer (BWT) value */
#if defined(FSL_FEATURE_UART_HAS_IMPROVED_SMART_CARD_SUPPORT) && (FSL_FEATURE_UART_HAS_IMPROVED_SMART_CARD_SUPPORT)
        /* EMV expectation: CWT = ((2^CWI + 11) + 4)
         * UART formula: CWT = 2^CWI1 + CWI2
         * EMV expectation: BGT = 22
         * UART formula: BWT = 16 + BGI */
        /* Set CW2 */
        if (context->cardParams.currentD == 1)
        {
            base->WP7816C_T1 = 15;
        }
        else
        {
            base->WP7816C_T1 = 15 + 1;
        }
        /* Set CW1 and Block Guard Time Integer */
        base->WGP7816_T1 = (uint8_t)((context->cardParams.CWI) << UART_WGP7816_T1_CWI1_SHIFT) |
                           (uint8_t)(context->cardParams.BGI & 0x0Fu);
#else
        base->WP7816T1 = (uint8_t)(base->WP7816T1 & ~UART_WP7816T1_CWI_MASK) |
                         (uint8_t)(context->cardParams.CWI << UART_WP7816T1_CWI_SHIFT);
#endif
        /* Set Extended Guard Timer value
         * EMV expectation: GT = GTN not equal to 255 -> 12 + GTN = GTN equal to 255 -> 11
         * UART formula: same as above */
        if (context->cardParams.GTN < 0xFE)
        {
            temp8 = context->cardParams.GTN + 1u;
        }
        else
        {
            temp8 = context->cardParams.GTN;
        }
        base->WN7816 = temp8;

        /* Set FD multiplier */
        base->WF7816 = context->cardParams.currentD;
        /* Setup for single wire ISO7816 mode, 9 bits per char */
        base->C1 |= UART_C1_LOOPS_MASK | UART_C1_RSRC_MASK | UART_C1_M_MASK;
        /* Set parity mode */
        if (context->parity == kSMARTCARD_OddParity)
        {
            base->C1 |= UART_C1_PT_MASK | UART_C1_PE_MASK;
        }
        else
        { /* Even parity */
            base->C1 = (base->C1 & ~UART_C1_PT_MASK) | UART_C1_PE_MASK;
        }
        /* Clear all ISO interrupt modes, and enable only GTV interrupt by default */
        base->IE7816 = UART_IE7816_GTVE_MASK;
        /* Enable ISO7816 mode and set transport protocol type to T=1*/
        base->C7816 |= (UART_C7816_ISO_7816E_MASK | UART_C7816_TTYPE_MASK);
        /* Set transport type to T=1 in SMARTCARD context structure */
        context->tType = kSMARTCARD_T1Transport;
    }
}

