RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/drivers/fsl_smartcard_uart.c
#if defined(FSL_FEATURE_SOC_PIT_COUNT) && (FSL_FEATURE_SOC_PIT_COUNT)
/*!
 * @brief Function un-gates peripheral clock of PIT0.
 */
static void smartcard_uart_TimerInit(uint8_t channel)
{
#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    /* Un-gate the PIT timer clock*/
    CLOCK_EnableClock(kCLOCK_Pit0);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */
    /* enable timers clock */
    PIT->MCR &= ~PIT_MCR_MDIS_MASK;
    /* Set timer period to zero */
    PIT->CHANNEL[channel].LDVAL = 0u;
    /* Stop timer and disable interrupt if it's not */
    PIT->CHANNEL[channel].TCTRL = 0u;
    /* Enable timer interrupt to occur */
    NVIC_EnableIRQ(PIT0_IRQn);
}

/*!
 * @brief Function gates peripheral clock of PIT0.
 */
static void smartcard_uart_TimerDeinit(void)
{
#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    /* Gate the PIT timer clock*/
    CLOCK_DisableClock(kCLOCK_Pit0);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */
    /* Disable pit IRQ interrupt to occur */
    NVIC_DisableIRQ(PIT0_IRQn);
}

/*!
 * brief Initializes timer specific channel with input period, enable channel interrupt and start counter.
 *
 * param channel The timer channel.
 * param time The time period.
 */
void smartcard_uart_TimerStart(uint8_t channel, uint32_t time)
{
    /* Set timer period */
    PIT->CHANNEL[channel].LDVAL = time;
    /* Clear timer interrupt flag */
    PIT->CHANNEL[channel].TFLG = 1u;
    /* Enable timer channel interrupt and timer */
    PIT->CHANNEL[channel].TCTRL = PIT_TCTRL_TIE_MASK | PIT_TCTRL_TEN_MASK;
}

/*!
 * @brief Stop timer specific channel, disable channel interrupts and stops counter.
 */
static void smartcard_uart_TimerStop(uint8_t channel)
{
    /* Stop timer if it's not and disable timer channel interrupt*/
    PIT->CHANNEL[channel].TCTRL &= ~(PIT_TCTRL_TEN_MASK | PIT_TCTRL_TIE_MASK);
}
#endif /* FSL_FEATURE_SOC_PIT_COUNT */

/*!
 * brief Fills in the smartcard_card_params structure with default values according to the EMV 4.3 specification.
 *
 * param cardParams The configuration structure of type smartcard_interface_config_t.
 * Function fill in members:
 *        Fi = 372;
 *        Di = 1;
 *        currentD = 1;
 *        WI = 0x0A;
 *        GTN = 0x00;
 * with default values.
 */
void SMARTCARD_UART_GetDefaultConfig(smartcard_card_params_t *cardParams)
{
    /* Initializes the configure structure to zero. */
    memset(cardParams, 0, sizeof(*cardParams));

    /* EMV default values */
    cardParams->Fi       = 372u;
    cardParams->Di       = 1u;
    cardParams->currentD = 1u;
    cardParams->WI       = 0x0Au;
    cardParams->GTN      = 0x00u;
}

/*!
 * brief Initializes a UART peripheral for the Smart card/ISO-7816 operation.
 *
 * This function un-gates the UART clock, initializes the module to EMV default settings,
 * configures the IRQ, enables the module-level interrupt to the core, and initializes the driver context.
 *
 * param base The UART peripheral base address.
 * param context A pointer to a smart card driver context structure.
 * param srcClock_Hz Smart card clock generation module source clock.
 *
 * return An error code or kStatus_SMARTCARD_Success.
 */
status_t SMARTCARD_UART_Init(UART_Type *base, smartcard_context_t *context, uint32_t srcClock_Hz)
{
    assert((NULL != base));

    if ((NULL == context) || (srcClock_Hz == 0u))
    {
        return kStatus_SMARTCARD_InvalidInput;
    }

    IRQn_Type uart_irqs[]      = UART_RX_TX_IRQS;
    IRQn_Type uartError_irqs[] = UART_ERR_IRQS;
    uint32_t instance          = 0u;

    context->base = base;
#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    /* Enable peripheral clock */
    CLOCK_EnableClock(s_uartClock[smartcard_uart_GetInstance(base)]);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */
    /* Initialize UART to a known context. */
    base->BDH = 0u;
    base->BDL = 0u;
    base->C1  = 0u;
    base->C2  = 0u;
    base->S2  = 0u;
    base->C3  = 0u;
#if defined(FSL_FEATURE_UART_HAS_ADDRESS_MATCHING) && (FSL_FEATURE_UART_HAS_ADDRESS_MATCHING)
    base->MA1 = 0u;
    base->MA2 = 0u;
#endif
    base->C4 = 0u;
#if defined(FSL_FEATURE_UART_HAS_DMA_ENABLE) && (FSL_FEATURE_UART_HAS_DMA_ENABLE)
    base->C5 = 0u;
#endif
#if defined(FSL_FEATURE_UART_HAS_MODEM_SUPPORT) && (FSL_FEATURE_UART_HAS_MODEM_SUPPORT)
    base->MODEM = 0u;
#endif
#if defined(FSL_FEATURE_UART_HAS_IR_SUPPORT) && (FSL_FEATURE_UART_HAS_IR_SUPPORT)
    base->IR = 0u;
#endif
#if defined(FSL_FEATURE_UART_HAS_FIFO) && (FSL_FEATURE_UART_HAS_FIFO)
    base->PFIFO  = 0u;
    base->CFIFO  = 0u;
    base->SFIFO  = 0xC0u;
    base->TWFIFO = 0u;
    base->RWFIFO = 1u;
#endif
    /* Initialize UART module for SMARTCARD mode of default operation */
    smartcard_uart_SetTransferType(base, context, kSMARTCARD_SetupATRMode);
#if defined(FSL_FEATURE_UART_HAS_FIFO) && (FSL_FEATURE_UART_HAS_FIFO)
    /* Flush fifo contents */
    base->CFIFO |= ((1u << UART_CFIFO_TXFLUSH_SHIFT) | (1u << UART_CFIFO_RXFLUSH_SHIFT));
#endif
    /* Compute size of tx fifo */
    context->txFifoEntryCount = 1u;
    if (base->PFIFO & UART_PFIFO_TXFIFOSIZE_MASK)
    {
        context->txFifoEntryCount =
            (1 << (((base->PFIFO & UART_PFIFO_TXFIFOSIZE_MASK) >> UART_PFIFO_TXFIFOSIZE_SHIFT) + 1));
        /* Enable tx fifo */
        base->PFIFO |= UART_PFIFO_TXFE_MASK;
    }

    /* Compute max value of rx fifo threshold (RXWATER) */
    context->rxFifoThreshold = 1u;
    if (base->PFIFO & UART_PFIFO_RXFIFOSIZE_MASK)
    {
        /* Size of rx fifo */
        context->rxFifoThreshold =
            (1 << (((base->PFIFO & UART_PFIFO_RXFIFOSIZE_MASK) >> UART_PFIFO_RXFIFOSIZE_SHIFT) + 1));
        /* The value of RXWATER must be set to less than the rx fifo buffer size */
        context->rxFifoThreshold--;
        /* Enable rx fifo */
        base->PFIFO |= UART_PFIFO_RXFE_MASK;
    }
#if defined(FSL_FEATURE_PIT_TIMER_COUNT) && (FSL_FEATURE_PIT_TIMER_COUNT)
    /* Initialize HW timer for the initial character (TS) delay measurement */
    smartcard_uart_TimerInit(context->interfaceConfig.tsTimerId);
#endif
    /* Enable UART interrupt on NVIC level. */
    instance = smartcard_uart_GetInstance(base);
    NVIC_EnableIRQ(uart_irqs[instance]);
    NVIC_EnableIRQ(uartError_irqs[instance]);
    /* Finally, disable the UART receiver and transmitter */
    base->C2 &= ~(UART_C2_TE_MASK | UART_C2_RE_MASK);

