RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/drivers/fsl_smartcard_uart.c
    /* TIE IRQ - tx fifo is empty */
    if ((base->C2 & UART_C2_TIE_MASK) && (base->S1 & UART_S1_TDRE_MASK))
    {
        while ((context->txFifoEntryCount - base->TCFIFO) && (context->xSize))
        {
            base->D = *(context->xBuff);
            ++context->xBuff;
            --context->xSize;
        }

        if (context->xSize == 0)
        {
            base->C2 &= ~UART_C2_TIE_MASK;
            base->C2 |= UART_C2_TCIE_MASK;
        }
    }
    SDK_ISR_EXIT_BARRIER;
}

/*!
 * @brief Configure baudrate
 *
 * @param base The UART peripheral base address.
 * @param context A pointer to a SMARTCARD driver context structure.
 *
 * @return An error code or kStatus_SMARTCARD_Success.
 */
static status_t smartcard_uart_ConfigureBaudrate(UART_Type *base, smartcard_context_t *context)
{
    if ((NULL == context))
    {
        return kStatus_SMARTCARD_InvalidInput;
    }

    uint32_t uartModuleClock;
    uint32_t instance;
    uint8_t temp;
    uint32_t brfa, sbr;
    uint32_t sourceClockInKHz = 0u;
    uint32_t sCClockInKHz     = 0u;

    instance = smartcard_uart_GetInstance(base);
    /* Get UART module clock from system clock module */
    switch (instance)
    {
        case 0u:
#if defined(UART0_CLK_SRC)
            uartModuleClock = CLOCK_GetFreq(UART0_CLK_SRC);
#else
            uartModuleClock = CLOCK_GetFreq(kCLOCK_CoreSysClk);
#endif
            break;
        case 1u:
#if defined(UART1_CLK_SRC)
            uartModuleClock = CLOCK_GetFreq(UART1_CLK_SRC);
#else
            uartModuleClock = CLOCK_GetFreq(kCLOCK_CoreSysClk);
#endif
            break;
#if (FSL_FEATURE_SOC_UART_COUNT >= 3)
        case 2u:
#if defined(UART2_CLK_SRC)
            uartModuleClock = CLOCK_GetFreq(UART2_CLK_SRC);
#else
            uartModuleClock = CLOCK_GetFreq(kCLOCK_CoreSysClk);
#endif
            break;
#endif
#if (FSL_FEATURE_SOC_UART_COUNT >= 4)
        case 3u:
#if defined(UART3_CLK_SRC)
            uartModuleClock = CLOCK_GetFreq(UART3_CLK_SRC);
#else
            uartModuleClock = CLOCK_GetFreq(kCLOCK_CoreSysClk);
#endif
            break;
#endif
#if (FSL_FEATURE_SOC_UART_COUNT >= 5)
        case 4u:
#if defined(UART4_CLK_SRC)
            uartModuleClock = CLOCK_GetFreq(UART4_CLK_SRC);
#else
            uartModuleClock = CLOCK_GetFreq(kCLOCK_CoreSysClk);
#endif
            break;
#endif
#if (FSL_FEATURE_SOC_UART_COUNT >= 6)
        case 5u:
#if defined(UART5_CLK_SRC)
            uartModuleClock = CLOCK_GetFreq(UART5_CLK_SRC);
#else
            uartModuleClock = CLOCK_GetFreq(kCLOCK_CoreSysClk);
#endif
            break;
#endif
        default:
            uartModuleClock = 0u;
            break;
    }
    sourceClockInKHz = uartModuleClock / 1000u;
    sCClockInKHz     = context->interfaceConfig.smartCardClock / 1000u;
    /* BaudRate = (SourceClkInHz)/[16 * (SBR +  BRFA)] */
    sbr = (uint16_t)(sourceClockInKHz * context->cardParams.Fi / (context->cardParams.currentD * sCClockInKHz * 16u));
    /* check to see if sbr is out of range of register bits */
    if ((sbr > 0x1FFFu) || (sbr < 1u))
    { /* unsupported baud rate for given source clock input*/
        return kStatus_SMARTCARD_OtherError;
    }
    switch (context->cardParams.currentD)
    {
        case 1:
        {
            if (context->cardParams.t0Indicated == 1)
            {
                sbr = sbr + SBR_CAL_ADJUST_D1_T0;
            }
            else
            {
                sbr = sbr + SBR_CAL_ADJUST_D1_T1;
            }

            break;
        }
        case 2:
        {
            if (context->cardParams.t0Indicated == 1)
            {
                sbr = sbr + SBR_CAL_ADJUST_D2_T0;
            }
            else
            {
                sbr = sbr + SBR_CAL_ADJUST_D2_T1;
            }

            break;
        }
        case 4:
        {
            if (context->cardParams.t0Indicated == 1)
            {
                sbr = sbr + SBR_CAL_ADJUST_D4_T0;
            }
            else
            {
                sbr = sbr + SBR_CAL_ADJUST_D4_T1;
            }

            break;
        }

        default:
            break;
    }
    base->C2 &= ~UART_C2_RE_MASK;
    temp      = base->BDH & ~UART_BDH_SBR_MASK;
    base->BDH = temp | (uint8_t)(sbr >> 8u);
    base->BDL = (uint8_t)sbr;
#if defined(FSL_FEATURE_UART_HAS_BAUD_RATE_FINE_ADJUST_SUPPORT) && (FSL_FEATURE_UART_HAS_BAUD_RATE_FINE_ADJUST_SUPPORT)
    /* determine if a fractional divider is needed to fine tune closer to the
     * desired baud, each value of brfa is in 1/32 increments,
     * hence the multiply-by-32. */
    brfa = (32u * sourceClockInKHz * context->cardParams.Fi) / (context->cardParams.currentD * sCClockInKHz * 16u);
    brfa -= (uint16_t)(32u * sbr);
    switch (context->cardParams.currentD)
    {
        case 1:
        {
            if (context->cardParams.t0Indicated == 1)
            {
                brfa = brfa + BRFA_CAL_ADJUST_D1_T0;
            }
            else
            {
                brfa = brfa + BRFA_CAL_ADJUST_D1_T1;
            }

            break;
        }
        case 2:
        {
            if (context->cardParams.t0Indicated == 1)
            {
                brfa = brfa + BRFA_CAL_ADJUST_D2_T0;
            }
            else
            {
                brfa = brfa + BRFA_CAL_ADJUST_D2_T1;
            }

            break;
        }
        case 4:
        {
            if (context->cardParams.t0Indicated == 1)
            {
                brfa = brfa + BRFA_CAL_ADJUST_D4_T0;
            }
            else
            {
                brfa = (uint32_t)((int32_t)brfa + BRFA_CAL_ADJUST_D4_T1);
            }

            break;
        }

        default:
            break;
    }
    /* write the brfa value to the register*/
    temp     = base->C4 & ~UART_C4_BRFA_MASK;
    base->C4 = temp | brfa;
#endif
    base->C2 |= UART_C2_RE_MASK;

    return kStatus_SMARTCARD_Success;
}

/*!
 * brief Controls the UART module per different user requests.
 *
 * param base The UART peripheral base address.
 * param context A pointer to a smart card driver context structure.
 * param control Smart card command type.
 * param param Integer value specific to a control command.
 *
 * return An kStatus_SMARTCARD_OtherError in case of error
 * return kStatus_SMARTCARD_Success in success
 */
status_t SMARTCARD_UART_Control(UART_Type *base,
                                smartcard_context_t *context,
                                smartcard_control_t control,
                                uint32_t param)
{
    if ((NULL == context))
    {
        return kStatus_SMARTCARD_InvalidInput;
    }

    uint8_t temp;

    switch (control)
    {
        case kSMARTCARD_EnableADT:
#if defined(FSL_FEATURE_UART_HAS_IMPROVED_SMART_CARD_SUPPORT) && (FSL_FEATURE_UART_HAS_IMPROVED_SMART_CARD_SUPPORT)
            /* Disable ISO-7816 mode first */
            base->C7816 &= ~UART_C7816_ISO_7816E_MASK;
            /* Set ATR timer value */
            base->AP7816A_T0 = (uint8_t)((SMARTCARD_EMV_ATR_DURATION_ETU) >> 8);
            base->AP7816B_T0 = (uint8_t)(SMARTCARD_EMV_ATR_DURATION_ETU);
            /* Enable ATR specific interrupt */
            base->IE7816 |= UART_IE7816_ADTE_MASK;
            /* Enable ISO-7816 mode */
            base->C7816 |= UART_C7816_ISO_7816E_MASK;
#endif
            break;
        case kSMARTCARD_DisableADT:
#if defined(FSL_FEATURE_UART_HAS_IMPROVED_SMART_CARD_SUPPORT) && (FSL_FEATURE_UART_HAS_IMPROVED_SMART_CARD_SUPPORT)
            /* Disable ATR specific interrupt */
            base->IE7816 &= ~UART_IE7816_ADTE_MASK;
            /* Clear ATR timer value */
            base->AP7816A_T0 = 0u;
            base->AP7816B_T0 = 0u;
#endif
            break;
        case kSMARTCARD_EnableGTV:
            /* Enable GTV specific interrupt */
            base->IE7816 |= UART_IE7816_GTVE_MASK;
            break;
        case kSMARTCARD_DisableGTV:
            /* Disable GTV specific interrupt */
            base->IE7816 &= ~UART_IE7816_GTVE_MASK;
            break;
        case kSMARTCARD_ResetWWT:
            /* save the current value of IE7816 register */
            temp = base->IE7816;
            /* disable 7816 function */
            base->C7816 &= ~UART_C7816_ISO_7816E_MASK;
            /* clear any pending WT interrupt flag */
            base->IS7816 = UART_IS7816_WT_MASK;
            /* enable 7816 function */
            base->C7816 |= UART_C7816_ISO_7816E_MASK;
            /* re-enable all interrupts */
            base->IE7816 = temp;
            break;
        case kSMARTCARD_EnableWWT:
            /* Enable WWT Timer interrupt to occur */
            base->IE7816 |= UART_IE7816_WTE_MASK;
            break;
        case kSMARTCARD_DisableWWT:
            /* Disable WWT Timer interrupt to occur */
            base->IE7816 &= ~UART_IE7816_WTE_MASK;
            break;
        case kSMARTCARD_ResetCWT:
            /* Reset CWT Timer */
            /* Save interrupts configuration */
            temp = base->IE7816;
            /* disable 7816 function */
            base->C7816 &= ~UART_C7816_ISO_7816E_MASK;
            /* Clear Character Wait Timer interrupt flag */
            base->IS7816 = UART_IS7816_CWT_MASK;
            /* enable 7816 function */
            base->C7816 |= UART_C7816_ISO_7816E_MASK;
            /* re-enable all interrupts */
            base->IE7816 = temp;
            break;
        case kSMARTCARD_EnableCWT:
            /* Enable CWT Timer interrupt to occur */
            base->IE7816 |= UART_IE7816_CWTE_MASK;
            break;
        case kSMARTCARD_DisableCWT:
            /* Disable WWT Timer interrupt to occur */
            base->IE7816 &= ~UART_IE7816_CWTE_MASK;
            break;
        case kSMARTCARD_ResetBWT:
            /* Reset BWT timer */
            /* Save interrupts configuration */
            temp = base->IE7816;
            /* disable 7816 function */
            base->C7816 &= ~UART_C7816_ISO_7816E_MASK;
            /* Clear Block Wait Timer interrupt flag */
            base->IS7816 = UART_IS7816_BWT_MASK;
            /* enable 7816 function */
            base->C7816 |= UART_C7816_ISO_7816E_MASK;
            /* re-enable all interrupts */
            base->IE7816 = temp;
            break;
        case kSMARTCARD_EnableBWT:
            /* Enable BWT Timer interrupt to occur */
            base->IE7816 |= UART_IE7816_BWTE_MASK;
            break;
        case kSMARTCARD_DisableBWT:
            /* Disable BWT Timer interrupt to occur */
            base->IE7816 &= ~UART_IE7816_BWTE_MASK;
            break;
        case kSMARTCARD_EnableInitDetect:
            /* Disable receiver */
            base->C2 &= ~UART_C2_RE_MASK;
            base->S2 &= ~(UART_S2_RXINV_MASK | UART_S2_MSBF_MASK);
            /* Clear all ISO7816 interrupt flags */
            base->IS7816 = 0xFFu;
            /* Enable initial character detection */
            base->C7816 |= UART_C7816_INIT_MASK;
            /* Check and clear any pending initial character detected flag */
            base->IS7816 = UART_IS7816_INITD_MASK;
            /* Enable TS detect interrupt*/
            base->IE7816 |= UART_IE7816_INITDE_MASK;
            break;
        case kSMARTCARD_EnableAnack:
            /* Enable NACK-on-error interrupt to occur */
            base->C7816 |= UART_C7816_ANACK_MASK;
            break;
        case kSMARTCARD_DisableAnack:
            /* Disable NACK-on-error interrupt to occur */
            base->C7816 &= ~UART_C7816_ANACK_MASK;
            break;
        case kSMARTCARD_ConfigureBaudrate:
            return smartcard_uart_ConfigureBaudrate(base, context);
        case kSMARTCARD_SetupATRMode:
            /* Set in default ATR mode */
            smartcard_uart_SetTransferType(base, context, kSMARTCARD_SetupATRMode);
            break;
        case kSMARTCARD_SetupT0Mode:
            /* Set transport protocol type to T=0 */
            smartcard_uart_SetTransferType(base, context, kSMARTCARD_SetupT0Mode);
            break;
        case kSMARTCARD_SetupT1Mode:
            /* Set transport protocol type to T=1 */
            smartcard_uart_SetTransferType(base, context, kSMARTCARD_SetupT1Mode);
            break;
        case kSMARTCARD_EnableReceiverMode:
            /* Enable receiver mode and switch to receive direction */
            base->C2 |= UART_C2_RE_MASK;
            base->C3 &= ~UART_C3_TXDIR_MASK;
            break;
        case kSMARTCARD_DisableReceiverMode:
            /* Disable receiver */
            base->C2 &= ~UART_C2_RE_MASK;
            break;
        case kSMARTCARD_EnableTransmitterMode:
            /* Enable transmitter mode and switch to transmit direction */
            base->C2 |= UART_C2_TE_MASK;
            base->C3 |= UART_C3_TXDIR_MASK;
            break;
        case kSMARTCARD_DisableTransmitterMode:
            /* Disable transmitter */
            base->C2 &= ~UART_C2_TE_MASK;
            break;
        case kSMARTCARD_ResetWaitTimeMultiplier:
#if defined(FSL_FEATURE_UART_HAS_IMPROVED_SMART_CARD_SUPPORT) && (FSL_FEATURE_UART_HAS_IMPROVED_SMART_CARD_SUPPORT)
            /* Reset Wait Timer Multiplier */
            /* Save interrupts configuration */
            temp = base->IE7816;
            /* Disable ISO7816 functionality */
            base->C7816 &= ~UART_C7816_ISO_7816E_MASK;
            /* Setting of the Wait Parameter Register */
            if (param > 1)
            {
                base->WP7816 = (uint8_t)(param - 1);
            }
            else
            {
                base->WP7816 = (uint8_t)(param);
            }
            /* enable 7816 functionality */
            base->C7816 |= UART_C7816_ISO_7816E_MASK;
            /* Restore interrupts configuration */
            base->IE7816 = temp;
            /* Set flag to SMARTCARD context accordingly */
            if ((uint8_t)param == 0u)
            {
                context->wtxRequested = false;
            }
            else
            {
                context->wtxRequested = true;
            }
#endif
            break;
        default:
            return kStatus_SMARTCARD_InvalidInput;
    }

    return kStatus_SMARTCARD_Success;
}

/*!
 * brief Handles initial TS character timer time-out event.
 *
 * param base The UART peripheral base address.
 * param context A pointer to a Smart card driver context structure.
 */
void SMARTCARD_UART_TSExpiryCallback(UART_Type *base, smartcard_context_t *context)
{
    if ((NULL == context))
    {
        return;
    }
#if defined(FSL_FEATURE_SOC_PIT_COUNT) && FSL_FEATURE_SOC_PIT_COUNT
    /* Clear PIT timer interrupt status flag */
    PIT->CHANNEL[context->interfaceConfig.tsTimerId].TFLG = PIT_TFLG_TIF_MASK;
#endif /* FSL_FEATURE_SOC_PIT_COUNT */
    /* Set timer has expired */
    context->timersState.initCharTimerExpired = true;
    /* Stop TS timer */
    smartcard_uart_TimerStop(context->interfaceConfig.tsTimerId);
    context->transferState = kSMARTCARD_IdleState;
    /* Un-block the caller */
    smartcard_uart_CompleteReceiveData(base, context);

    return;
}
